## KHÓA HỌC: KỸ NGHỆ TRI THỨC VÀ HỌC MÁY
-----
Chương 2 - Thu thập và chuẩn bị dữu liệu - Phần 03
----
Giảng Viên: Đặng Văn Nam

Email: dangvannam@humg.edu.vn

# Nội dung bài học
---
1. Xóa cột/hàng trong Dataframe
2. Xử lý hàng trùng lặp (Duplicate rows)
3. Sắp xếp trong DataFrame
4. Nhóm các hàng trong DataFrame dựa vào giá trị (Groupby)
5. Áp dụng hàm cho các phần tử trong một cột (Apply)
6. Ghép nối các DataFrame (Concatenating)
7. Trộn các DataFrame (Merging)
8. Ví dụ xử lý dữ liệu

# 1) Xóa cột/hàng trong DataFrame
---

In [1]:
#Khai báo sử dụng thư viện
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
#Đọc dữ liệu mẫu được lưu trữ trong file csv
path='Data_Excercise\csv_Data_Loan.csv'
df_loan=pd.read_csv(path)
df_loan.head()

,loan_amnt,term,int_rate,emp_length,home_ownership,annual_inc,purpose,addr_state,dti,delinq_2yrs,revol_util,total_acc,bad_loan,longest_credit_length,verification_status
0,5000,36 months,10.65,10.0,RENT,24000.0,credit_card,AZ,27.65,0.0,83.7,9.0,0,26.0,verified
1,2500,60 months,15.27,0.0,RENT,30000.0,car,GA,1.00,0.0,9.4,4.0,1,12.0,verified
2,2400,36 months,15.96,10.0,RENT,12252.0,small_business,IL,8.72,0.0,98.5,10.0,0,10.0,not verified
3,10000,36 months,13.49,10.0,RENT,49200.0,other,CA,20.00,0.0,21.0,37.0,0,15.0,verified
4,5000,36 months,7.90,3.0,RENT,36000.0,wedding,AZ,11.20,0.0,28.3,12.0,0,7.0,verified

In [3]:
#Quan sát dữ liệu biến DataFrame
df_loan.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 163987 entries, 0 to 163986
Data columns (total 15 columns):
 #   Column                 Non-Null Count   Dtype
---  ------                 --------------   -----
 0   loan_amnt              163987 non-null  int64
 1   term                   163987 non-null  object
 2   int_rate               163987 non-null  float64
 3   emp_length             158183 non-null  float64
 4   home_ownership         163987 non-null  object
 5   annual_inc             163983 non-null  float64
 6   purpose                163987 non-null  object
 7   addr_state             163987 non-null  object
 8   dti                    163987 non-null  float64
 9   delinq_2yrs            163958 non-null  float64
 10  revol_util             163794 non-null  float64
 11  total_acc              163958 non-null  float64
 12  bad_loan               163987 non-null  int64
 13  longest_credit_length  163958 non-null  float64
 14  verification_status    163987 non-null  object
dtypes: float64(8), int64(2), object(5)
memory usage: 18.8+ MB

In [4]:
#Xử dụng .drop(axis=1|columns) để xóa cột
#Xóa một số cột trong df_loan
df_loan1 = df_loan.drop(['annual_inc',
                         'dti','delinq_2yrs',
                         'revol_util',
                         'longest_credit_length',
                         'verification_status'], axis=1)
df_loan1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 163987 entries, 0 to 163986
Data columns (total 9 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   loan_amnt       163987 non-null  int64
 1   term            163987 non-null  object
 2   int_rate        163987 non-null  float64
 3   emp_length      158183 non-null  float64
 4   home_ownership  163987 non-null  object
 5   purpose         163987 non-null  object
 6   addr_state      163987 non-null  object
 7   total_acc       163958 non-null  float64
 8   bad_loan        163987 non-null  int64
dtypes: float64(3), int64(2), object(4)
memory usage: 11.3+ MB

In [5]:
df_loan1.head()

,loan_amnt,term,int_rate,emp_length,home_ownership,purpose,addr_state,total_acc,bad_loan
0,5000,36 months,10.65,10.0,RENT,credit_card,AZ,9.0,0
1,2500,60 months,15.27,0.0,RENT,car,GA,4.0,1
2,2400,36 months,15.96,10.0,RENT,small_business,IL,10.0,0
3,10000,36 months,13.49,10.0,RENT,other,CA,37.0,0
4,5000,36 months,7.90,3.0,RENT,wedding,AZ,12.0,0

In [6]:
#Xóa cột trong một DataFrame sử dụng chỉ số cột
df_loan2 = df_loan.drop(df_loan.columns[[5,8,9,10,13,14]], 
                        axis='columns')
df_loan2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 163987 entries, 0 to 163986
Data columns (total 9 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   loan_amnt       163987 non-null  int64
 1   term            163987 non-null  object
 2   int_rate        163987 non-null  float64
 3   emp_length      158183 non-null  float64
 4   home_ownership  163987 non-null  object
 5   purpose         163987 non-null  object
 6   addr_state      163987 non-null  object
 7   total_acc       163958 non-null  float64
 8   bad_loan        163987 non-null  int64
dtypes: float64(3), int64(2), object(4)
memory usage: 11.3+ MB

In [7]:
df_loan2.head(10)

,loan_amnt,term,int_rate,emp_length,home_ownership,purpose,addr_state,total_acc,bad_loan
0,5000,36 months,10.65,10.0,RENT,credit_card,AZ,9.0,0
1,2500,60 months,15.27,0.0,RENT,car,GA,4.0,1
2,2400,36 months,15.96,10.0,RENT,small_business,IL,10.0,0
3,10000,36 months,13.49,10.0,RENT,other,CA,37.0,0
4,5000,36 months,7.90,3.0,RENT,wedding,AZ,12.0,0
5,3000,36 months,18.64,9.0,RENT,car,CA,4.0,0
6,5600,60 months,21.28,4.0,OWN,small_business,CA,13.0,1
7,5375,60 months,12.69,0.0,RENT,other,TX,3.0,1
8,6500,60 months,14.65,5.0,OWN,debt_consolidation,AZ,23.0,0
9,12000,36 months,12.69,10.0,OWN,debt_consolidation,CA,34.0,0

In [8]:
#Xóa hàng trong một DataFrame
#Xóa hàng có index: 3,9
df_loan2.drop([3,9],inplace=True)
df_loan2.head(10)

,loan_amnt,term,int_rate,emp_length,home_ownership,purpose,addr_state,total_acc,bad_loan
0,5000,36 months,10.65,10.0,RENT,credit_card,AZ,9.0,0
1,2500,60 months,15.27,0.0,RENT,car,GA,4.0,1
2,2400,36 months,15.96,10.0,RENT,small_business,IL,10.0,0
4,5000,36 months,7.90,3.0,RENT,wedding,AZ,12.0,0
5,3000,36 months,18.64,9.0,RENT,car,CA,4.0,0
6,5600,60 months,21.28,4.0,OWN,small_business,CA,13.0,1
7,5375,60 months,12.69,0.0,RENT,other,TX,3.0,1
8,6500,60 months,14.65,5.0,OWN,debt_consolidation,AZ,23.0,0
10,9000,36 months,13.49,0.0,RENT,debt_consolidation,VA,9.0,1
11,3000,36 months,9.91,3.0,RENT,credit_card,IL,11.0,0

In [9]:
#Loại bỏ tất cả các dòng dữ liệu có addr_state = CA
df_loan3 = df_loan1[df_loan1.addr_state!='CA']
df_loan3

,loan_amnt,term,int_rate,emp_length,home_ownership,purpose,addr_state,total_acc,bad_loan
0,5000,36 months,10.65,10.0,RENT,credit_card,AZ,9.0,0
1,2500,60 months,15.27,0.0,RENT,car,GA,4.0,1
2,2400,36 months,15.96,10.0,RENT,small_business,IL,10.0,0
4,5000,36 months,7.90,3.0,RENT,wedding,AZ,12.0,0
7,5375,60 months,12.69,0.0,RENT,other,TX,3.0,1
...,...,...,...,...,...,...,...,...,...
163982,15000,60 months,12.39,3.0,MORTGAGE,credit_card,OK,34.0,0
163983,20000,36 months,14.99,10.0,OWN,home_improvement,VA,18.0,0
163984,12825,36 months,17.14,6.0,MORTGAGE,debt_consolidation,TX,24.0,0
163985,27650,60 months,21.99,0.0,RENT,credit_card,NY,20.0,0
163986,17000,60 months,15.99,10.0,MORTGAGE,debt_consolidation,PA,28.0,0

## 2) Xử lý hàng trùng lặp trong DataFrame
---

In [10]:
#Tạo DataFrame mẫu
d = { 'Name':['Alisa','raghu','jodha','jodha','raghu','Cathrine', 'Alisa','Bobby','Bobby','Alisa','raghu','Cathrine'],
     'Age':[26,23,23,23,23,24,26,24,22,26,23,24], 
     'Score':[85,31,55,55,31,77,85,63,42,85,31,np.nan]}
df = pd.DataFrame(d,columns=['Name','Age','Score'])
df

        Name  Age  Score
0      Alisa   26   85.0
1      raghu   23   31.0
2      jodha   23   55.0
3      jodha   23   55.0
4      raghu   23   31.0
5   Cathrine   24   77.0
6      Alisa   26   85.0
7      Bobby   24   63.0
8      Bobby   22   42.0
9      Alisa   26   85.0
10     raghu   23   31.0
11  Cathrine   24    NaN

In [11]:
#Trường hợp 1:
#Sử dụng df.drop_duplicates() với các tham số mặc định
#--> giữ lại hàng trùng lặp đầu tiên
df1 = df.drop_duplicates()
df1

        Name  Age  Score
0      Alisa   26   85.0
1      raghu   23   31.0
2      jodha   23   55.0
5   Cathrine   24   77.0
7      Bobby   24   63.0
8      Bobby   22   42.0
11  Cathrine   24    NaN

In [12]:
#Trường hợp 2:
#Sử dụng df.drop_duplicates()
#với các tham số keep='last'
#Giữ lại các hàng trùng lặp cuối cùng
df2=df.drop_duplicates(keep='last')
df2

        Name  Age  Score
3      jodha   23   55.0
5   Cathrine   24   77.0
7      Bobby   24   63.0
8      Bobby   22   42.0
9      Alisa   26   85.0
10     raghu   23   31.0
11  Cathrine   24    NaN

In [13]:
#Trường hợp 3:
#Sử dụng df.drop_duplicates()
#với các tham số keep=False
#Xóa hết các hàng trùng lặp khỏi df
df3=df.drop_duplicates(keep=False)
df3

        Name  Age  Score
5   Cathrine   24   77.0
7      Bobby   24   63.0
8      Bobby   22   42.0
11  Cathrine   24    NaN

In [14]:
#Trường hợp 4:
#Sử dụng df.drop_duplicates()
#Loại bỏ các hàng trùng nhau theo cột Name
df4=df.drop_duplicates(['Name'],keep='first')
df4

       Name  Age  Score
0     Alisa   26   85.0
1     raghu   23   31.0
2     jodha   23   55.0
5  Cathrine   24   77.0
7     Bobby   24   63.0

In [15]:
#Trường hợp 5:
#Sử dụng df.drop_duplicates()
#Loại bỏ các hàng trùng nhau theo cột Name, Age
df5=df.drop_duplicates(['Name','Age'],
                       keep='first')
df5

       Name  Age  Score
0     Alisa   26   85.0
1     raghu   23   31.0
2     jodha   23   55.0
5  Cathrine   24   77.0
7     Bobby   24   63.0
8     Bobby   22   42.0

## 3) Sắp xếp dữ liệu trong Pandas
---

In [16]:
#Tạo dữ liệu mẫu
d = {'Name':pd.Series(['Alisa','Bobby','Cathrine','Madonna','Rocky','Sebastian','Jaqluine',
   'Rahul','David','Andrew','Ajay','Teresa','Madonna']),
   'Age':pd.Series([26,27,25,24,31,27,25,33,42,32,51,47,38]),
   'Score':pd.Series([89,87,67,55,47,72,76,79,44,92,99,69,73])}
#Create a DataFrame
df = pd.DataFrame(d)
df

         Name  Age  Score
0       Alisa   26     89
1       Bobby   27     87
2    Cathrine   25     67
3     Madonna   24     55
4       Rocky   31     47
5   Sebastian   27     72
6    Jaqluine   25     76
7       Rahul   33     79
8       David   42     44
9      Andrew   32     92
10       Ajay   51     99
11     Teresa   47     69
12    Madonna   38     73

In [17]:
#Trường hợp 1:
#Sắp xếp dữ liệu Dataframe theo cột Score
#Mặc định là sắp xếp tăng dần
df.sort_values(by='Name')

         Name  Age  Score
10       Ajay   51     99
0       Alisa   26     89
9      Andrew   32     92
1       Bobby   27     87
2    Cathrine   25     67
8       David   42     44
6    Jaqluine   25     76
3     Madonna   24     55
12    Madonna   38     73
7       Rahul   33     79
4       Rocky   31     47
5   Sebastian   27     72
11     Teresa   47     69

In [18]:
#Trường hợp 2:
#Sắp xếp dữ liệu Dataframe theo cột Score
#Giá trị giảm dần
df.sort_values(by='Score',ascending=False)

         Name  Age  Score
10       Ajay   51     99
9      Andrew   32     92
0       Alisa   26     89
1       Bobby   27     87
7       Rahul   33     79
6    Jaqluine   25     76
12    Madonna   38     73
5   Sebastian   27     72
11     Teresa   47     69
2    Cathrine   25     67
3     Madonna   24     55
4       Rocky   31     47
8       David   42     44

In [22]:
#Trường hợp 3:
#Sắp xếp dữ liệu Dataframe theo cột Name, Score
#Giá trị tăng dần
df.sort_values(by=['Name','Score'])

         Name  Age  Score
10       Ajay   51     99
0       Alisa   26     89
9      Andrew   32     92
1       Bobby   27     87
2    Cathrine   25     67
8       David   42     44
6    Jaqluine   25     76
3     Madonna   24     55
12    Madonna   38     73
7       Rahul   33     79
4       Rocky   31     47
5   Sebastian   27     72
11     Teresa   47     69

In [20]:
#Trường hợp 4:
#Sắp xếp dữ liệu Dataframe theo cột Name, Score
#Giá trị cột Name tăng dần
#Giá trị cột Score giảm dần
df.sort_values(by=['Name','Score'],
               ascending=[True,False])

         Name  Age  Score
10       Ajay   51     99
0       Alisa   26     89
9      Andrew   32     92
1       Bobby   27     87
2    Cathrine   25     67
8       David   42     44
6    Jaqluine   25     76
12    Madonna   38     73
3     Madonna   24     55
7       Rahul   33     79
4       Rocky   31     47
5   Sebastian   27     72
11     Teresa   47     69

In [23]:
#Trường hợp 4:
#Sắp xếp dữ liệu Dataframe theo cột Name, Score
df.sort_values(by=['Age','Score'],
               ascending=[True,True])

         Name  Age  Score
3     Madonna   24     55
2    Cathrine   25     67
6    Jaqluine   25     76
0       Alisa   26     89
5   Sebastian   27     72
1       Bobby   27     87
4       Rocky   31     47
9      Andrew   32     92
7       Rahul   33     79
12    Madonna   38     73
8       David   42     44
11     Teresa   47     69
10       Ajay   51     99

## 4) Nhóm dữ liệu (groupby)
---

In [24]:
#Tạo dữ liệu mẫu
d = {'Name':['Alisa','Bobby','Cathrine','Alisa','Bobby','Cathrine','Alisa','Bobby','Cathrine','Alisa','Bobby','Cathrine'],
    'Exam':['Semester 1','Semester 1','Semester 1','Semester 1','Semester 1','Semester 1','Semester 2','Semester 2','Semester 2','Semester 2','Semester 2','Semester 2'],
    'Subject':['Mathematics','Mathematics','Mathematics','Science','Science','Science','Mathematics','Mathematics','Mathematics','Science','Science','Science'],
    'Score':[62,47,55,74,31,77,85,63,42,67,89,81]}
df = pd.DataFrame(d,columns=['Name','Exam','Subject','Score'])
df

        Name        Exam      Subject  Score
0      Alisa  Semester 1  Mathematics     62
1      Bobby  Semester 1  Mathematics     47
2   Cathrine  Semester 1  Mathematics     55
3      Alisa  Semester 1      Science     74
4      Bobby  Semester 1      Science     31
5   Cathrine  Semester 1      Science     77
6      Alisa  Semester 2  Mathematics     85
7      Bobby  Semester 2  Mathematics     63
8   Cathrine  Semester 2  Mathematics     42
9      Alisa  Semester 2      Science     67
10     Bobby  Semester 2      Science     89
11  Cathrine  Semester 2      Science     81

In [25]:
#Trường hợp 1:
#Nhóm theo tên sinh viên (Name)
#Thực hiện tính điểm trung bình Score
df['Score'].groupby([df['Name']]).mean()

Name
Alisa       72.00
Bobby       57.50
Cathrine    63.75
Name: Score, dtype: float64

In [26]:
(67+74+85+62)/4

72.0

In [27]:
#Trường hợp 2:
#Nhóm dữ liệu theo tên sinh viên (Name)
#và Bài kiểm tra (Exam)
#sau đó thực hiện tính tổng
df['Score'].groupby([df['Name'],
                     df['Exam']]).sum()

Name      Exam
Alisa     Semester 1    136
          Semester 2    152
Bobby     Semester 1     78
          Semester 2    152
Cathrine  Semester 1    132
          Semester 2    123
Name: Score, dtype: int64

In [28]:
#Trường hợp 3:
#Nhóm dữ liệu theo Subject và Exam
#Thực hiện tính tổng Score
df.groupby(['Subject', 'Exam']).sum()

                        Score
Subject     Exam
Mathematics Semester 1    164
            Semester 2    190
Science     Semester 1    182
            Semester 2    237

## THỰC HÀNH 1
---
**Yêu cầu 1.1:**
Đọc dữ liệu từ file Data_Patient.csv vào biến kiểu dataframe: df_patient với cột id là cột chỉ số (index_col); Hiển thị 10 dòng dữ liệu đầu tiên

In [ ]:
#{Học viên viết code thực hiện yêu cầu vào đây!}

### **Yêu cầu 1.2:**
Xóa cột dữ liệu có tên ‘Thalassemia’ và áp dụng thay đổi lên chính df_patient.

In [ ]:
#{Học viên viết code thực hiện yêu cầu vào đây!}

### **Yêu cầu 1.3:**
A) Tạo df_patient1 bằng cách loại bỏ đi 100 dòng dữ liệu đầu tiên từ df_patient.

B) Tạo df_patient2 bằng cách loại bỏ đi các dòng dữ liệu có thuộc tính Type = ‘Non-anginal pain’ và nhip tim > 187 từ df_patient.

In [29]:
#{Học viên viết code thực hiện yêu cầu vào đây!}

### **Yêu cầu 1.4:**
---

A) Sắp xếp lại dữ liệu cho df_patient theo chiều giảm dần của index, áp dụng thay đổi trực tiếp lên DataFrame này.

B) Tạo df_patient3 bằng cách sắp xếp dữ liệu theo thuộc tính Gender tăng dần, Nếu trùng giá trị Gender thì sắp xếp theo thuộc tính Age giảm dần.

In [ ]:
#A. {Học viên viết code thực hiện yêu cầu vào đây!}

In [ ]:
#B. {Học viên viết code thực hiện yêu cầu vào đây!}

### **Yêu cầu 1.5:**
A) Nhóm bệnh nhân theo thuộc tính Gender và tìm tuổi lớn nhất, nhỏ nhất, trung bình của bệnh nhân theo giới tính.

In [ ]:
#{Học viên viết code thực hiện yêu cầu vào đây!}

#### B) Nhóm bệnh nhân theo thuộc tính Gender và Type và tìm tuổi lớn nhất, nhỏ nhất, trung bình của bệnh nhân theo giới tính và loại đau ngực.

In [ ]:
#{Học viên viết code thực hiện yêu cầu vào đây!}

### Yêu cầu 1.6:
---
A) Thực hiện xóa các bệnh nhân có index trùng nhau, giữ lại bệnh nhân có index trùng nhau đầu tiên, áp dụng cho chính dataframe hiện tại.

In [ ]:
#{Học viên viết code thực hiện yêu cầu vào đây!}

## 5) Apply(function)
---

In [16]:
#Tạo dữ liệu mẫu
d = {'Name':pd.Series(['william','Mason','ella','jackson','lincoln','aubrey','Hudson','christian','Sawyer','silas','Bennett','kingston']),
    'Score_Math':pd.Series([66,57,75,44,31,67,85,33,42,62,51,47]),
    'Score_Science':pd.Series([89,87,67,55,47,72,76,79,44,92,93,69])}
df = pd.DataFrame(d)
df

         Name  Score_Math  Score_Science
0     william          66             89
1       Mason          57             87
2        ella          75             67
3     jackson          44             55
4     lincoln          31             47
5      aubrey          67             72
6      Hudson          85             76
7   christian          33             79
8      Sawyer          42             44
9       silas          62             92
10    Bennett          51             93
11   kingston          47             69

In [ ]:
##ÁP DỤNG HÀM CHO TỪNG CỘT RIÊNG LẺ
#-----------------------------------------------------------

In [17]:
#Thực hiện: Viết hoa tên học sinh
#Cách 1:
def upcase(x):
    return x.upper()

df['Name'] = df['Name'].apply(upcase)
df

         Name  Score_Math  Score_Science
0     WILLIAM          66             89
1       MASON          57             87
2        ELLA          75             67
3     JACKSON          44             55
4     LINCOLN          31             47
5      AUBREY          67             72
6      HUDSON          85             76
7   CHRISTIAN          33             79
8      SAWYER          42             44
9       SILAS          62             92
10    BENNETT          51             93
11   KINGSTON          47             69

In [18]:
#Cách 2: 
df['Name'] = df['Name'].apply(lambda x:x.upper())
df

         Name  Score_Math  Score_Science
0     WILLIAM          66             89
1       MASON          57             87
2        ELLA          75             67
3     JACKSON          44             55
4     LINCOLN          31             47
5      AUBREY          67             72
6      HUDSON          85             76
7   CHRISTIAN          33             79
8      SAWYER          42             44
9       SILAS          62             92
10    BENNETT          51             93
11   KINGSTON          47             69

In [21]:
#Cách 3:
df['Name'] = df['Name'].str.upper()
df

         Name  Score_Math  Score_Science
0     WILLIAM          66             89
1       MASON          57             87
2        ELLA          75             67
3     JACKSON          44             55
4     LINCOLN          31             47
5      AUBREY          67             72
6      HUDSON          85             76
7   CHRISTIAN          33             79
8      SAWYER          42             44
9       SILAS          62             92
10    BENNETT          51             93
11   KINGSTON          47             69

In [36]:
#Điểm trung bình = (score_math*2 + score_science)/3
#Viết hàm tính điểm trung bình
def mean_point(point1,point2):
    return round((point1*2+point2)/3,1)

In [37]:
#Tạo một cột Point tính điểm của từng học sinh
df['Point'] = df.apply(lambda row: mean_point(row['Score_Math'],
                                              row['Score_Science']), 
                       axis=1)
df

         Name  Score_Math  Score_Science  Point
0     WILLIAM          66             89   73.7
1       MASON          57             87   67.0
2        ELLA          75             67   72.3
3     JACKSON          44             55   47.7
4     LINCOLN          31             47   36.3
5      AUBREY          67             72   68.7
6      HUDSON          85             76   82.0
7   CHRISTIAN          33             79   48.3
8      SAWYER          42             44   42.7
9       SILAS          62             92   72.0
10    BENNETT          51             93   65.0
11   KINGSTON          47             69   54.3

In [38]:
#.apply(func) áp dụng một hàm cho dataframe theo hàng hoặc cột
df2 = df.apply(np.mean,axis=1)
df2

TypeError: can only concatenate str (not "int") to str

In [26]:
### Áp dụng .appply() Xử lý dữ liệu file csv_Data_BMI
#-----------------------------------------------------
path = 'Data_Excercise\csv_Data_BMI.csv'
df_bmi = pd.read_csv(path,index_col=0)
df_bmi.info()

<class 'pandas.core.frame.DataFrame'>
Index: 500 entries, P1 to P500
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Gender     500 non-null    object
 1   Height_cm  500 non-null    int64
 2   Weight_kg  500 non-null    int64
dtypes: int64(2), object(1)
memory usage: 15.6+ KB

In [27]:
df_bmi.head()

          Gender  Height_cm  Weight_kg
Personal
P1          Male        174         96
P2          Male        189         87
P3        Female        185        110
P4        Female        195        104
P5          Male        149         61

In [28]:
#Tạo thêm một cột 'Height_m' đổi dữ liệu Height từ cm --> m
df_bmi['Height_m'] = df_bmi['Height_cm']/100
df_bmi.head()

          Gender  Height_cm  Weight_kg  Height_m
Personal
P1          Male        174         96      1.74
P2          Male        189         87      1.89
P3        Female        185        110      1.85
P4        Female        195        104      1.95
P5          Male        149         61      1.49

In [30]:
#Viết hàm tính chỉ số BMI dựa và Height (cm), Weight (kg)
def bmi(h,w):
    h = h/100
    bmi = round(w/(h**2),1)
    return bmi

In [31]:
#Áp dụng hàm tính BMI cho các hàng dữ liệu của DF
df_bmi['BMI'] = df_bmi.apply(lambda row: bmi(row['Height_cm'],row['Weight_kg']), axis=1)
df_bmi.head()

          Gender  Height_cm  Weight_kg  Height_m   BMI
Personal
P1          Male        174         96      1.74  31.7
P2          Male        189         87      1.89  24.4
P3        Female        185        110      1.85  32.1
P4        Female        195        104      1.95  27.4
P5          Male        149         61      1.49  27.5

In [34]:
#Dựa vào chỉ số xác định mức béo phì
#---
def check_bmi(x):
    if (x<18.5):
        return 'UNDERWEIGHT'
    elif (18.5 <= x <= 24.9):
        return 'NORMAL'
    elif (25.0 <= x <= 29.9):
        return 'OVERWEIGHT'
    elif (30.0 <= x <= 34.9):
        return 'OBESE'
    else:
        return 'EXTREMELY OBESE'

In [35]:
df_bmi['Type'] = df_bmi['BMI'].apply(lambda x: check_bmi(x))
df_bmi.head()

          Gender  Height_cm  Weight_kg  Height_m   BMI        Type
Personal
P1          Male        174         96      1.74  31.7       OBESE
P2          Male        189         87      1.89  24.4      NORMAL
P3        Female        185        110      1.85  32.1       OBESE
P4        Female        195        104      1.95  27.4  OVERWEIGHT
P5          Male        149         61      1.49  27.5  OVERWEIGHT

In [39]:
#Group dữ liệu theo Type
df_bmi.groupby(['Type']).count()

                 Gender  Height_cm  Weight_kg  Height_m  BMI
Type
EXTREMELY OBESE     268        268        268       268  268
NORMAL               64         64         64        64   64
OBESE                64         64         64        64   64
OVERWEIGHT           70         70         70        70   70
UNDERWEIGHT          34         34         34        34   34

In [40]:
#Group dữ liệu theo giới tính và loại
df_bmi.groupby(['Gender','Type']).count()

                        Height_cm  Weight_kg  Height_m  BMI
Gender Type
Female EXTREMELY OBESE        131        131       131  131
       NORMAL                  38         38        38   38
       OBESE                   36         36        36   36
       OVERWEIGHT              37         37        37   37
       UNDERWEIGHT             13         13        13   13
Male   EXTREMELY OBESE        137        137       137  137
       NORMAL                  26         26        26   26
       OBESE                   28         28        28   28
       OVERWEIGHT              33         33        33   33
       UNDERWEIGHT             21         21        21   21

In [41]:
#Lọc dữ liệu: Danh sách những người béo phì
df_bmi[df_bmi.Type=='EXTREMELY OBESE']

          Gender  Height_cm  Weight_kg  Height_m   BMI             Type
Personal
P7          Male        147         92      1.47  42.6  EXTREMELY OBESE
P8          Male        154        111      1.54  46.8  EXTREMELY OBESE
P10       Female        169        103      1.69  36.1  EXTREMELY OBESE
P16       Female        153        107      1.53  45.7  EXTREMELY OBESE
P17       Female        157        110      1.57  44.6  EXTREMELY OBESE
...          ...        ...        ...       ...   ...              ...
P496      Female        150        153      1.50  68.0  EXTREMELY OBESE
P497      Female        184        121      1.84  35.7  EXTREMELY OBESE
P498      Female        141        136      1.41  68.4  EXTREMELY OBESE
P499        Male        150         95      1.50  42.2  EXTREMELY OBESE
P500        Male        173        131      1.73  43.8  EXTREMELY OBESE

[268 rows x 6 columns]

In [42]:
#Lọc dữ liệu: Danh sách những người béo phì
df_bmi[(df_bmi.Gender =='Male') & (df_bmi.Type=='EXTREMELY OBESE')]

         Gender  Height_cm  Weight_kg  Height_m   BMI             Type
Personal
P7         Male        147         92      1.47  42.6  EXTREMELY OBESE
P8         Male        154        111      1.54  46.8  EXTREMELY OBESE
P18        Male        140        129      1.40  65.8  EXTREMELY OBESE
P19        Male        144        145      1.44  69.9  EXTREMELY OBESE
P20        Male        172        139      1.72  47.0  EXTREMELY OBESE
...         ...        ...        ...       ...   ...              ...
P484       Male        146         85      1.46  39.9  EXTREMELY OBESE
P486       Male        173        111      1.73  37.1  EXTREMELY OBESE
P495       Male        152         98      1.52  42.4  EXTREMELY OBESE
P499       Male        150         95      1.50  42.2  EXTREMELY OBESE
P500       Male        173        131      1.73  43.8  EXTREMELY OBESE

[137 rows x 6 columns]

## 6. Kết nối và trộn dữ liệu giữa các DataFrame (merge, concat)
---

### A) Ví dụ về việc nối, trộn các dataset trong Pandas

In [43]:
import pandas as pd
import numpy as np

class display(object):
    """Display HTML representation of multiple objects"""
    template = """<div style="float: left; padding: 10px;">
    <p style='font-family:"Courier New", Courier, monospace'>{0}</p>{1}
    </div>"""
    def __init__(self, *args):
        self.args = args
        
    def _repr_html_(self):
        return '\n'.join(self.template.format(a, eval(a)._repr_html_())
                         for a in self.args)
    
    def __repr__(self):
        return '\n\n'.join(a + '\n' + repr(eval(a))
                           for a in self.args)

In [44]:
#File state-population.csv lưu trữ dân số của 48 bang của Mỹ [1990-2013]
#Bao gồm tổng số dân | số dân dưới 18 tuổi
pop = pd.read_csv('Data_Excercise/state-population.csv')
pop.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2544 entries, 0 to 2543
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   state/region  2544 non-null   object
 1   ages          2544 non-null   object
 2   year          2544 non-null   int64
 3   population    2524 non-null   float64
dtypes: float64(1), int64(1), object(2)
memory usage: 79.6+ KB

In [45]:
#File state-areas.csv lưu trữ diện tích của 51 bang [dặm vuông]
areas = pd.read_csv('Data_Excercise/state-areas.csv')
areas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 52 entries, 0 to 51
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   state          52 non-null     object
 1   area (sq. mi)  52 non-null     int64
dtypes: int64(1), object(1)
memory usage: 960.0+ bytes

In [46]:
#File stae-abbrevs.csv lưu trữ tên và ký hiệu của 50 bang
abbrevs = pd.read_csv('Data_Excercise/state-abbrevs.csv')
abbrevs.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 51 entries, 0 to 50
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   state         51 non-null     object
 1   abbreviation  51 non-null     object
dtypes: object(2)
memory usage: 944.0+ bytes

### Yêu cầu bài toán:
---
**Thực hiện xếp hạng các tiểu bang và vùng lãnh thổ của Hoa kỳ theo mật độ dân số năm 2010**

Để thực hiện yêu cầu này bắt buộc phải kết hợp các dữ liệu từ 3 file lại với nhau

In [47]:
display('pop.head()', 'areas.head()', 'abbrevs.head()')

pop.head()
  state/region     ages  year  population
0           AL  under18  2012   1117489.0
1           AL    total  2012   4817528.0
2           AL  under18  2010   1130966.0
3           AL    total  2010   4785570.0
4           AL  under18  2011   1125763.0

areas.head()
        state  area (sq. mi)
0     Alabama          52423
1      Alaska         656425
2     Arizona         114006
3    Arkansas          53182
4  California         163707

abbrevs.head()
        state abbreviation
0     Alabama           AL
1      Alaska           AK
2     Arizona           AZ
3    Arkansas           AR
4  California           CA

In [48]:
#Bước 1: kết hợp dữ liệu file state-population với state-abbrevs 
#để lấy được tên đầy đủ của các bang 
merged = pd.merge(pop, abbrevs, 
                  how='outer',
                  left_on='state/region', 
                  right_on='abbreviation')

merged.head()

  state/region     ages  year  population    state abbreviation
0           AL  under18  2012   1117489.0  Alabama           AL
1           AL    total  2012   4817528.0  Alabama           AL
2           AL  under18  2010   1130966.0  Alabama           AL
3           AL    total  2010   4785570.0  Alabama           AL
4           AL  under18  2011   1125763.0  Alabama           AL

In [49]:
#Xóa cột abbreviation vì trùng lặp với state/region
merged = merged.drop('abbreviation', 1)
merged.head()

  state/region     ages  year  population    state
0           AL  under18  2012   1117489.0  Alabama
1           AL    total  2012   4817528.0  Alabama
2           AL  under18  2010   1130966.0  Alabama
3           AL    total  2010   4785570.0  Alabama
4           AL  under18  2011   1125763.0  Alabama

In [50]:
#Kiểm tra việc ghép dữ liệu có thiếu (null) hàng nào ko?
merged.isnull().any()

state/region    False
ages            False
year            False
population       True
state            True
dtype: bool

In [51]:
#Một số thông tin về dân số không có dữ liệu
merged[merged['population'].isnull()].tail(10)
#Bang PR không có dữ liệu về dân số trước năm 2000

     state/region     ages  year  population state
2458           PR    total  1995         NaN   NaN
2459           PR  under18  1995         NaN   NaN
2460           PR  under18  1996         NaN   NaN
2461           PR    total  1996         NaN   NaN
2462           PR  under18  1998         NaN   NaN
2463           PR    total  1998         NaN   NaN
2464           PR    total  1997         NaN   NaN
2465           PR  under18  1997         NaN   NaN
2466           PR    total  1999         NaN   NaN
2467           PR  under18  1999         NaN   NaN

In [52]:
#Kiểm tra danh sách các mã bang không có tên đầy đủ
merged.loc[merged['state'].isnull(), 'state/region'].unique()

#---> Có 2 mã PR, USA không có tên đầy đủ trong file state-abbrevs.csv

array(['PR', 'USA'], dtype=object)

In [53]:
#Xử lý bằng cách điền trực tiếp tên đầy đủ cho 2 mã này
merged.loc[merged['state/region'] == 'PR', 'state'] = 'Puerto Rico'
merged.loc[merged['state/region'] == 'USA', 'state'] = 'United States'
merged.isnull().any()

state/region    False
ages            False
year            False
population       True
state           False
dtype: bool

In [54]:
#Bước 2: Kết hợp dữ liệu merged với dữ liệu state-areas.csv
#Việc kết hợp dựa vào cột state
display('merged.head()','areas.head()')

merged.head()
  state/region     ages  year  population    state
0           AL  under18  2012   1117489.0  Alabama
1           AL    total  2012   4817528.0  Alabama
2           AL  under18  2010   1130966.0  Alabama
3           AL    total  2010   4785570.0  Alabama
4           AL  under18  2011   1125763.0  Alabama

areas.head()
        state  area (sq. mi)
0     Alabama          52423
1      Alaska         656425
2     Arizona         114006
3    Arkansas          53182
4  California         163707

In [55]:
#Kết hợp hai DataFrame dựa vào cột state
final = pd.merge(merged, areas, on='state', how='left')
final.head()

  state/region     ages  year  population    state  area (sq. mi)
0           AL  under18  2012   1117489.0  Alabama        52423.0
1           AL    total  2012   4817528.0  Alabama        52423.0
2           AL  under18  2010   1130966.0  Alabama        52423.0
3           AL    total  2010   4785570.0  Alabama        52423.0
4           AL  under18  2011   1125763.0  Alabama        52423.0

In [56]:
#Kiểm tra dữ liệu Null khi ghép 
final.isnull().any()

state/region     False
ages             False
year             False
population        True
state            False
area (sq. mi)     True
dtype: bool

In [57]:
#Liệt hàng null
final['state'][final['area (sq. mi)'].isnull()].unique()

array(['United States'], dtype=object)

In [58]:
#View dữ liệu có state = 'United States'
final[final['state']=='United States']

     state/region     ages  year   population          state  area (sq. mi)
2496          USA  under18  1990   64218512.0  United States            NaN
2497          USA    total  1990  249622814.0  United States            NaN
2498          USA    total  1991  252980942.0  United States            NaN
2499          USA  under18  1991   65313018.0  United States            NaN
2500          USA  under18  1992   66509177.0  United States            NaN
2501          USA    total  1992  256514231.0  United States            NaN
2502          USA    total  1993  259918595.0  United States            NaN
2503          USA  under18  1993   67594938.0  United States            NaN
2504          USA  under18  1994   68640936.0  United States            NaN
2505          USA    total  1994  263125826.0  United States            NaN
2506          USA  under18  1995   69473140.0  United States            NaN
2507          USA  under18  1996   70233512.0  United States            NaN
2508          USA    total  1995  266278403.0  United States            NaN
2509          USA    total  1996  269394291.0  United States            NaN
2510          USA    total  1997  272646932.0  United States            NaN
2511          USA  under18  1997   70920738.0  United States            NaN
2512          USA  under18  1998   71431406.0  United States            NaN
2513          USA    total  1998  275854116.0  United States            NaN
2514          USA  under18  1999   71946051.0  United States            NaN
2515          USA    total  2000  282162411.0  United States            NaN
2516          USA  under18  2000   72376189.0  United States            NaN
2517          USA    total  1999  279040181.0  United States            NaN
2518          USA    total  2001  284968955.0  United States            NaN
2519          USA  under18  2001   72671175.0  United States            NaN
2520          USA    total  2002  287625193.0  United States            NaN
2521          USA  under18  2002   72936457.0  United States            NaN
2522          USA    total  2003  290107933.0  United States            NaN
2523          USA  under18  2003   73100758.0  United States            NaN
2524          USA    total  2004  292805298.0  United States            NaN
2525          USA  under18  2004   73297735.0  United States            NaN
2526          USA    total  2005  295516599.0  United States            NaN
2527          USA  under18  2005   73523669.0  United States            NaN
2528          USA    total  2006  298379912.0  United States            NaN
2529          USA  under18  2006   73757714.0  United States            NaN
2530          USA    total  2007  301231207.0  United States            NaN
2531          USA  under18  2007   74019405.0  United States            NaN
2532          USA    total  2008  304093966.0  United States            NaN
2533          USA  under18  2008   74104602.0  United States            NaN
2534          USA  under18  2013   73585872.0  United States            NaN
2535          USA    total  2013  316128839.0  United States            NaN
2536          USA    total  2009  306771529.0  United States            NaN
2537          USA  under18  2009   74134167.0  United States            NaN
2538          USA  under18  2010   74119556.0  United States            NaN
2539          USA    total  2010  309326295.0  United States            NaN
2540          USA  under18  2011   73902222.0  United States            NaN
2541          USA    total  2011  311582564.0  United States            NaN
2542          USA  under18  2012   73708179.0  United States            NaN
2543          USA    total  2012  313873685.0  United States            NaN

In [59]:
final.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2544 entries, 0 to 2543
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   state/region   2544 non-null   object
 1   ages           2544 non-null   object
 2   year           2544 non-null   int64
 3   population     2524 non-null   float64
 4   state          2544 non-null   object
 5   area (sq. mi)  2496 non-null   float64
dtypes: float64(2), int64(1), object(3)
memory usage: 139.1+ KB

In [60]:
#Có thể tính toán diện tích của USA bằng cách sử dụng hàm Sum để tính tổng diện tích của tất cả các bang
#Tuy nhiên, trong yêu cầu đặt ra là xếp hạng tiểu bang và vùng lãnh thổ. Nên dữ liệu về cả USA là không
#cần thiết. Để đơn giản trong trường hợp này, chúng ta xóa các hàng USA.
final.dropna(inplace=True)
final.head()

  state/region     ages  year  population    state  area (sq. mi)
0           AL  under18  2012   1117489.0  Alabama        52423.0
1           AL    total  2012   4817528.0  Alabama        52423.0
2           AL  under18  2010   1130966.0  Alabama        52423.0
3           AL    total  2010   4785570.0  Alabama        52423.0
4           AL  under18  2011   1125763.0  Alabama        52423.0

In [ ]:
final.info()

In [ ]:
#Đến đây chúng ta đã có tất cả dữ liệu chúng ta cần cho bài toán, 
#Các dữ liệu liên quan từ 3 file khác nhau đã được kết hợp lại.

In [61]:
#Bước 3: Truy vấn dữ liệu cần cho yêu cầu
#-------------------------------
#Yêu cầu: Tỷ lệ dân số năm 2010 --> Dữ liệu năm 2010 | Tổng số dân
data2010 = final.query("year==2010 & ages=='total'")
data2010.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 52 entries, 3 to 2490
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   state/region   52 non-null     object
 1   ages           52 non-null     object
 2   year           52 non-null     int64
 3   population     52 non-null     float64
 4   state          52 non-null     object
 5   area (sq. mi)  52 non-null     float64
dtypes: float64(2), int64(1), object(3)
memory usage: 2.8+ KB

In [62]:
data2010

,state/region,ages,year,population,state,area (sq. mi)
3,AL,total,2010,4785570.0,Alabama,52423.0
91,AK,total,2010,713868.0,Alaska,656425.0
101,AZ,total,2010,6408790.0,Arizona,114006.0
189,AR,total,2010,2922280.0,Arkansas,53182.0
197,CA,total,2010,37333601.0,California,163707.0
283,CO,total,2010,5048196.0,Colorado,104100.0
293,CT,total,2010,3579210.0,Connecticut,5544.0
379,DE,total,2010,899711.0,Delaware,1954.0
389,DC,total,2010,605125.0,District of Columbia,68.0
475,FL,total,2010,18846054.0,Florida,65758.0
485,GA,total,2010,9713248.0,Georgia,59441.0
570,HI,total,2010,1363731.0,Hawaii,10932.0
581,ID,total,2010,1570718.0,Idaho,83574.0
666,IL,total,2010,12839695.0,Illinois,57918.0
677,IN,total,2010,6489965.0,Indiana,36420.0
762,IA,total,2010,3050314.0,Iowa,56276.0
773,KS,total,2010,2858910.0,Kansas,82282.0
858,KY,total,2010,4347698.0,Kentucky,40411.0
869,LA,total,2010,4545392.0,Louisiana,51843.0
954,ME,total,2010,1327366.0,Maine,35387.0
965,MD,total,2010,5787193.0,Maryland,12407.0
1050,MA,total,2010,6563263.0,Massachusetts,10555.0
1061,MI,total,2010,9876149.0,Michigan,96810.0
1146,MN,total,2010,5310337.0,Minnesota,86943.0
1157,MS,total,2010,2970047.0,Mississippi,48434.0
1242,MO,total,2010,5996063.0,Missouri,69709.0
1253,MT,total,2010,990527.0,Montana,147046.0
1338,NE,total,2010,1829838.0,Nebraska,77358.0
1349,NV,total,2010,2703230.0,Nevada,110567.0
1434,NH,total,2010,1316614.0,New Hampshire,9351.0
1445,NJ,total,2010,8802707.0,New Jersey,8722.0
1530,NM,total,2010,2064982.0,New Mexico,121593.0
1541,NY,total,2010,19398228.0,New York,54475.0
1626,NC,total,2010,9559533.0,North Carolina,53821.0
1637,ND,total,2010,674344.0,North Dakota,70704.0
1722,OH,total,2010,11545435.0,Ohio,44828.0
1733,OK,total,2010,3759263.0,Oklahoma,69903.0
1818,OR,total,2010,3837208.0,Oregon,98386.0
1829,PA,total,2010,12710472.0,Pennsylvania,46058.0
1914,RI,total,2010,1052669.0,Rhode Island,1545.0
1925,SC,total,2010,4636361.0,South Carolina,32007.0
2010,SD,total,2010,816211.0,South Dakota,77121.0
2021,TN,total,2010,6356683.0,Tennessee,42146.0
2106,TX,total,2010,25245178.0,Texas,268601.0
2117,UT,total,2010,2774424.0,Utah,84904.0
2202,VT,total,2010,625793.0,Vermont,9615.0
2213,VA,total,2010,8024417.0,Virginia,42769.0
2298,WA,total,2010,6742256.0,Washington,71303.0
2309,WV,total,2010,1854146.0,West Virginia,24231.0
2394,WI,total,2010,5689060.0,Wisconsin,65503.0
2405,WY,total,2010,564222.0,Wyoming,97818.0
2490,PR,total,2010,3721208.0,Puerto Rico,3515.0

In [63]:
# chỉ lấy dữ liệu của các cột [state, population, area (sq. mi)]
data_ok = data2010[['state','population','area (sq. mi)']]
#Thiết lập cột state làm index
#data_ok.set_index('state', inplace=True)
data_ok.head()

          state  population  area (sq. mi)
3       Alabama   4785570.0        52423.0
91       Alaska    713868.0       656425.0
101     Arizona   6408790.0       114006.0
189    Arkansas   2922280.0        53182.0
197  California  37333601.0       163707.0

In [64]:
data_ok['density'] = data_ok['population'] / data_ok['area (sq. mi)']
data_ok.head()

<ipython-input-64-02f3e558b00e>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data_ok['density'] = data_ok['population'] / data_ok['area (sq. mi)']

          state  population  area (sq. mi)     density
3       Alabama   4785570.0        52423.0   91.287603
91       Alaska    713868.0       656425.0    1.087509
101     Arizona   6408790.0       114006.0   56.214497
189    Arkansas   2922280.0        53182.0   54.948667
197  California  37333601.0       163707.0  228.051342

In [65]:
#Sắp xếp lại dữ liệu theo chiều giảm dần của density
data_ok.sort_values(by=['density'],ascending=False,inplace=True)
data_ok

<ipython-input-65-4fe2354de20f>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data_ok.sort_values(by=['density'],ascending=False,inplace=True)

                     state  population  area (sq. mi)      density
389   District of Columbia    605125.0           68.0  8898.897059
2490           Puerto Rico   3721208.0         3515.0  1058.665149
1445            New Jersey   8802707.0         8722.0  1009.253268
1914          Rhode Island   1052669.0         1545.0   681.339159
293            Connecticut   3579210.0         5544.0   645.600649
1050         Massachusetts   6563263.0        10555.0   621.815538
965               Maryland   5787193.0        12407.0   466.445797
379               Delaware    899711.0         1954.0   460.445752
1541              New York  19398228.0        54475.0   356.094135
475                Florida  18846054.0        65758.0   286.597129
1829          Pennsylvania  12710472.0        46058.0   275.966651
1722                  Ohio  11545435.0        44828.0   257.549634
197             California  37333601.0       163707.0   228.051342
666               Illinois  12839695.0        57918.0   221.687472
2213              Virginia   8024417.0        42769.0   187.622273
677                Indiana   6489965.0        36420.0   178.197831
1626        North Carolina   9559533.0        53821.0   177.617157
485                Georgia   9713248.0        59441.0   163.409902
2021             Tennessee   6356683.0        42146.0   150.825298
1925        South Carolina   4636361.0        32007.0   144.854594
1434         New Hampshire   1316614.0         9351.0   140.799273
570                 Hawaii   1363731.0        10932.0   124.746707
858               Kentucky   4347698.0        40411.0   107.586994
1061              Michigan   9876149.0        96810.0   102.015794
2298            Washington   6742256.0        71303.0    94.557817
2106                 Texas  25245178.0       268601.0    93.987655
3                  Alabama   4785570.0        52423.0    91.287603
869              Louisiana   4545392.0        51843.0    87.676099
2394             Wisconsin   5689060.0        65503.0    86.851900
1242              Missouri   5996063.0        69709.0    86.015622
2309         West Virginia   1854146.0        24231.0    76.519582
2202               Vermont    625793.0         9615.0    65.085075
1157           Mississippi   2970047.0        48434.0    61.321530
1146             Minnesota   5310337.0        86943.0    61.078373
101                Arizona   6408790.0       114006.0    56.214497
189               Arkansas   2922280.0        53182.0    54.948667
762                   Iowa   3050314.0        56276.0    54.202751
1733              Oklahoma   3759263.0        69903.0    53.778278
283               Colorado   5048196.0       104100.0    48.493718
1818                Oregon   3837208.0        98386.0    39.001565
954                  Maine   1327366.0        35387.0    37.509990
773                 Kansas   2858910.0        82282.0    34.745266
2117                  Utah   2774424.0        84904.0    32.677188
1349                Nevada   2703230.0       110567.0    24.448796
1338              Nebraska   1829838.0        77358.0    23.654153
581                  Idaho   1570718.0        83574.0    18.794338
1530            New Mexico   2064982.0       121593.0    16.982737
2010          South Dakota    816211.0        77121.0    10.583512
1637          North Dakota    674344.0        70704.0     9.537565
1253               Montana    990527.0       147046.0     6.736171
2405               Wyoming    564222.0        97818.0     5.768079
91                  Alaska    713868.0       656425.0     1.087509

### 6.1) Trộn dữ liệu giữa các DataFrame (merge)
---

In [66]:
#Tạo dữ liệu mẫu
#DataFrame1:
d1 = {'Customer_id':pd.Series([1,2,3,4,5,6]),
      'Product':pd.Series(['Oven','Oven','Oven','Television','Television','Television'])}
df1 = pd.DataFrame(d1)

#DataFrame2:
d2 = {'Customer_id':pd.Series([2,4,6,7,8]),
    'State':pd.Series(['California','California','Texas','New York','Indiana'])}
df2 = pd.DataFrame(d2)

display('df1.head(10)','df2.head(10)')

df1.head(10)
   Customer_id     Product
0            1        Oven
1            2        Oven
2            3        Oven
3            4  Television
4            5  Television
5            6  Television

df2.head(10)
   Customer_id       State
0            2  California
1            4  California
2            6       Texas
3            7    New York
4            8     Indiana

In [67]:
#Trường hợp 1:
#Inner join DataFrame
inner_join_df= pd.merge(df1, df2, 
                        on='Customer_id', 
                        how='inner')
inner_join_df

   Customer_id     Product       State
0            2        Oven  California
1            4  Television  California
2            6  Television       Texas

In [68]:
#Trường hợp 2:
#Outer join DataFrame
inner_join_df= pd.merge(df1, df2, 
                        on='Customer_id', 
                        how='outer')
inner_join_df

   Customer_id     Product       State
0            1        Oven         NaN
1            2        Oven  California
2            3        Oven         NaN
3            4  Television  California
4            5  Television         NaN
5            6  Television       Texas
6            7         NaN    New York
7            8         NaN     Indiana

In [69]:
#Trường hợp 3:
#Left join DataFrame
inner_join_df= pd.merge(df1, df2, 
                        on='Customer_id', 
                        how='left')
inner_join_df

   Customer_id     Product       State
0            1        Oven         NaN
1            2        Oven  California
2            3        Oven         NaN
3            4  Television  California
4            5  Television         NaN
5            6  Television       Texas

In [70]:
#Trường hợp 4:
#Right join DataFrame
inner_join_df= pd.merge(df1, df2, 
                        on='Customer_id', 
                        how='right')
inner_join_df

   Customer_id     Product       State
0            2        Oven  California
1            4  Television  California
2            6  Television       Texas
3            7         NaN    New York
4            8         NaN     Indiana

### 6.2) Nối dữ liệu giữa các DataFrame
---

### a) Kết nối các dataframe theo cột [concat(axis=1)]
---

In [71]:
#Tạo dữ liệu mẫu
d = {'Name':['Alisa','Bobby','Cathrine','Madonna','Rocky','Sebastian','Jaqluine','Rahul','David'],
    'Score1':[62,47,55,74,31,77,85,63,42],
    'Score2':[89,87,67,55,47,72,76,79,44]}
df1 = pd.DataFrame(d)
df1

        Name  Score1  Score2
0      Alisa      62      89
1      Bobby      47      87
2   Cathrine      55      67
3    Madonna      74      55
4      Rocky      31      47
5  Sebastian      77      72
6   Jaqluine      85      76
7      Rahul      63      79
8      David      42      44

In [72]:
d = {'Name':['Alisa','Bobby','Cathrine','Madonna','Rocky','Sebastian','Jaqluine'],
    'Score3':[56,86,77,45,73,62,74]}
df2 = pd.DataFrame(d)
df2

        Name  Score3
0      Alisa      56
1      Bobby      86
2   Cathrine      77
3    Madonna      45
4      Rocky      73
5  Sebastian      62
6   Jaqluine      74

In [73]:
#Trường hợp 1:
#Mặc định join='outer'
df_concat1 = pd.concat([df1, df2], axis=1)
df_concat1

        Name  Score1  Score2       Name  Score3
0      Alisa      62      89      Alisa    56.0
1      Bobby      47      87      Bobby    86.0
2   Cathrine      55      67   Cathrine    77.0
3    Madonna      74      55    Madonna    45.0
4      Rocky      31      47      Rocky    73.0
5  Sebastian      77      72  Sebastian    62.0
6   Jaqluine      85      76   Jaqluine    74.0
7      Rahul      63      79        NaN     NaN
8      David      42      44        NaN     NaN

In [74]:
#Trường hợp 2:
#Tham số join='inner'
df_concat2 = pd.concat([df1, df2], 
                       axis=1, 
                       join='inner')
df_concat2

        Name  Score1  Score2       Name  Score3
0      Alisa      62      89      Alisa      56
1      Bobby      47      87      Bobby      86
2   Cathrine      55      67   Cathrine      77
3    Madonna      74      55    Madonna      45
4      Rocky      31      47      Rocky      73
5  Sebastian      77      72  Sebastian      62
6   Jaqluine      85      76   Jaqluine      74

In [75]:
#Trường hợp 3:
#Tham số ignore_index=True
#(Không sử dụng tên cột, đánh lại nhãn 0, 1...)
df_concat3 = pd.concat([df1, df2], 
                       axis=1, 
                       join='inner',
                       ignore_index=True)
df_concat3

           0   1   2          3   4
0      Alisa  62  89      Alisa  56
1      Bobby  47  87      Bobby  86
2   Cathrine  55  67   Cathrine  77
3    Madonna  74  55    Madonna  45
4      Rocky  31  47      Rocky  73
5  Sebastian  77  72  Sebastian  62
6   Jaqluine  85  76   Jaqluine  74

### 6.2) Kết nối các dataframe theo hàng
---
concat() | append()

In [76]:
#Tạo dữ liệu mẫu:
d1 = {'Name':['Alisa','Bobby','Cathrine','Madonna','Rocky'],
   'Score1':[62,47,55,74,31],
   'Score2':[89,87,67,55,47],
   'Score3':[56,86,77,45,73]}
df1 = pd.DataFrame(d1)

d2 = {'Name':['Andrew','Ajay','Teresa'],
     'Score1':[32,71,57],
     'Score2':[92,99,69],
     'Score3':[67,97,68]}
df2 = pd.DataFrame(d2)

display('df1.head()','df2.head()')

df1.head()
       Name  Score1  Score2  Score3
0     Alisa      62      89      56
1     Bobby      47      87      86
2  Cathrine      55      67      77
3   Madonna      74      55      45
4     Rocky      31      47      73

df2.head()
     Name  Score1  Score2  Score3
0  Andrew      32      92      67
1    Ajay      71      99      97
2  Teresa      57      69      68

In [77]:
#Trường hợp 1: sử dụng concat
df_row = pd.concat([df1,df2],ignore_index=True)
df_row

       Name  Score1  Score2  Score3
0     Alisa      62      89      56
1     Bobby      47      87      86
2  Cathrine      55      67      77
3   Madonna      74      55      45
4     Rocky      31      47      73
5    Andrew      32      92      67
6      Ajay      71      99      97
7    Teresa      57      69      68

In [78]:
#Trường hợp 1: Sử dụng append()
df_row2 = df1.append(df2)
df_row2

       Name  Score1  Score2  Score3
0     Alisa      62      89      56
1     Bobby      47      87      86
2  Cathrine      55      67      77
3   Madonna      74      55      45
4     Rocky      31      47      73
0    Andrew      32      92      67
1      Ajay      71      99      97
2    Teresa      57      69      68

In [79]:
#Trường hợp các cột khác tên nối vào nhau
d = {'Name':['Jack','danny','vishwa'],
   'Score1':[32,71,70],
   'Score4':[72,91,89],
   'Score5':[57,72,78]}
df3 = pd.DataFrame(d)
display('df1.head()','df3.head()')

df1.head()
       Name  Score1  Score2  Score3
0     Alisa      62      89      56
1     Bobby      47      87      86
2  Cathrine      55      67      77
3   Madonna      74      55      45
4     Rocky      31      47      73

df3.head()
     Name  Score1  Score4  Score5
0    Jack      32      72      57
1   danny      71      91      72
2  vishwa      70      89      78

In [80]:
#Trường hợp các cột khác tên
pd.concat([df1,df3])

       Name  Score1  Score2  Score3  Score4  Score5
0     Alisa      62    89.0    56.0     NaN     NaN
1     Bobby      47    87.0    86.0     NaN     NaN
2  Cathrine      55    67.0    77.0     NaN     NaN
3   Madonna      74    55.0    45.0     NaN     NaN
4     Rocky      31    47.0    73.0     NaN     NaN
0      Jack      32     NaN     NaN    72.0    57.0
1     danny      71     NaN     NaN    91.0    72.0
2    vishwa      70     NaN     NaN    89.0    78.0

In [81]:
#sử dụng tham số join='inner'
pd.concat([df1,df3], join ='inner')

       Name  Score1
0     Alisa      62
1     Bobby      47
2  Cathrine      55
3   Madonna      74
4     Rocky      31
0      Jack      32
1     danny      71
2    vishwa      70

In [82]:
#Trường hợp 2
pd.concat([df1,df3], keys=['df1','df3'])

           Name  Score1  Score2  Score3  Score4  Score5
df1 0     Alisa      62    89.0    56.0     NaN     NaN
    1     Bobby      47    87.0    86.0     NaN     NaN
    2  Cathrine      55    67.0    77.0     NaN     NaN
    3   Madonna      74    55.0    45.0     NaN     NaN
    4     Rocky      31    47.0    73.0     NaN     NaN
df3 0      Jack      32     NaN     NaN    72.0    57.0
    1     danny      71     NaN     NaN    91.0    72.0
    2    vishwa      70     NaN     NaN    89.0    78.0

## THỰC HÀNH 2
---
**Yêu cầu 2.1:**
Đọc dữ liệu từ file Data_Point.xlsx vào biến kiểu dataframe: 
    * df_lop1 dữ liệu điểm sheet 0 (4080130_01)
    * df_lop2 dữ liệu điểm sheet 1 (4080130_02)
    * df_lop3 dữ liệu điểm sheet 2 (4080130_03)

THAM KHẢO LẠI BÀI HỌC SỐ 06 ĐỂ ĐỌC DỮ LIỆU

In [ ]:
#{Học viên viết code thực hiện yêu cầu vào đây!}

### **Yêu cầu 2.2:**
---
Nối 3 DataFrame df_lop1, df_lop2, df_lop3 thành một DataFrame df_full chứa tất cả danh sách bảng điểm của 3 lớp

In [ ]:
#{Học viên viết code thực hiện yêu cầu vào đây!}

### **Yêu cầu 2.3:**
---
Trong df_full: Tạo một cột Diem_he10 được tính dựa vào các cột tương ứng của từng hàng dữ liệu, theo công thức sau:

**Diem_he10 = 0.6 * A + 0.3 * ((B1+B2)/2) + 0.1 * ((C1+C2)/2)**
    
Làm tròn đến 1 số sau dấu phẩy

In [ ]:
#{Học viên viết code thực hiện yêu cầu vào đây!}

### **Yêu cầu 2.4:**
---
Từ cột Diem_he10 trong df_full tạo một cột Diem_chu, Diem_so theo quy đổi:

    * Điểm hệ 10 Từ 9.0 đến 10.0  ----> Điểm chữ: A+  ----> Điểm số: 4.0
    * Điểm hệ 10 Từ 8.5 đến 8.9  ----> Điểm chữ: A    ----> Điểm số: 3.7
    * Điểm hệ 10 Từ 8.0 đến 8.4  ----> Điểm chữ: B+   ----> Điểm số: 3.5   
    * Điểm hệ 10 Từ 7.0 đến 7.9  ----> Điểm chữ: B    ----> Điểm số: 3.0
    * Điểm hệ 10 Từ 6.5 đến 6.9  ----> Điểm chữ: C+   ----> Điểm số: 2.5  
    * Điểm hệ 10 Từ 5.5 đến 6.4  ----> Điểm chữ: C    ----> Điểm số: 2.0     
    * Điểm hệ 10 Từ 5.0 đến 5.4  ----> Điểm chữ: D+   ----> Điểm số: 1.5 
    * Điểm hệ 10 Từ 4.0 đến 4.9  ----> Điểm chữ: D    ----> Điểm số: 1.0  
    * Điểm hệ 10 Từ 0.0 đến 3.9  ----> Điểm chữ: F    ----> Điểm số: 0.0

In [ ]:
#{Học viên viết code thực hiện yêu cầu vào đây!}

### **Yêu cầu 2.5:**
---
Tạo một DataFrame df_diem_ok chỉ lấy dữ liệu các cột [‘Code’, ‘Diem_he10’, ‘Diem_chu’, ‘Diem_so’] từ df_full

In [ ]:
#{Học viên viết code thực hiện yêu cầu vào đây!}

###  **Yêu cầu 2.6:**
---
1. Đọc dữ liệu trong sheet: code của file excel Data_point vào DataFrame df_code.
2. Trộn (merge) dữ liệu của df_code và df_diem_ok để ghép phách cho bảng điểm và lưu và df_finaly.
3. Lưu dữ liệu trong DataFrame df_finaly ra file excel: Diem_4080130.xlsx

In [ ]:
#{Học viên viết code thực hiện yêu cầu vào đây!}